espressif/esp-idf/components/soc/esp32s31/register/soc/dma2d_reg.h
/** DMA2D_OUT_LINK_CONF_CH2_REG register
 *  Configures the tx descriptor operations of channel 2
 */
#define DMA2D_OUT_LINK_CONF_CH2_REG (DR_REG_DMA2D_BASE + 0x21c)
/** DMA2D_OUTLINK_STOP_CH2 : R/W/SC; bitpos: [20]; default: 0;
 *  Set this bit to stop dealing with the outlink descriptors.
 */
#define DMA2D_OUTLINK_STOP_CH2    (BIT(20))
#define DMA2D_OUTLINK_STOP_CH2_M  (DMA2D_OUTLINK_STOP_CH2_V << DMA2D_OUTLINK_STOP_CH2_S)
#define DMA2D_OUTLINK_STOP_CH2_V  0x00000001U
#define DMA2D_OUTLINK_STOP_CH2_S  20
/** DMA2D_OUTLINK_START_CH2 : R/W/SC; bitpos: [21]; default: 0;
 *  Set this bit to start dealing with the outlink descriptors.
 */
#define DMA2D_OUTLINK_START_CH2    (BIT(21))
#define DMA2D_OUTLINK_START_CH2_M  (DMA2D_OUTLINK_START_CH2_V << DMA2D_OUTLINK_START_CH2_S)
#define DMA2D_OUTLINK_START_CH2_V  0x00000001U
#define DMA2D_OUTLINK_START_CH2_S  21
/** DMA2D_OUTLINK_RESTART_CH2 : R/W/SC; bitpos: [22]; default: 0;
 *  Set this bit to restart a new outlink from the last address.
 */
#define DMA2D_OUTLINK_RESTART_CH2    (BIT(22))
#define DMA2D_OUTLINK_RESTART_CH2_M  (DMA2D_OUTLINK_RESTART_CH2_V << DMA2D_OUTLINK_RESTART_CH2_S)
#define DMA2D_OUTLINK_RESTART_CH2_V  0x00000001U
#define DMA2D_OUTLINK_RESTART_CH2_S  22
/** DMA2D_OUTLINK_PARK_CH2 : RO; bitpos: [23]; default: 1;
 *  1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM
 *  is working.
 */
#define DMA2D_OUTLINK_PARK_CH2    (BIT(23))
#define DMA2D_OUTLINK_PARK_CH2_M  (DMA2D_OUTLINK_PARK_CH2_V << DMA2D_OUTLINK_PARK_CH2_S)
#define DMA2D_OUTLINK_PARK_CH2_V  0x00000001U
#define DMA2D_OUTLINK_PARK_CH2_S  23

/** DMA2D_OUT_LINK_ADDR_CH2_REG register
 *  Configures the tx descriptor address of channel 2
 */
#define DMA2D_OUT_LINK_ADDR_CH2_REG (DR_REG_DMA2D_BASE + 0x220)
/** DMA2D_OUTLINK_ADDR_CH2 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the first outlink descriptor's address.
 */
#define DMA2D_OUTLINK_ADDR_CH2    0xFFFFFFFFU
#define DMA2D_OUTLINK_ADDR_CH2_M  (DMA2D_OUTLINK_ADDR_CH2_V << DMA2D_OUTLINK_ADDR_CH2_S)
#define DMA2D_OUTLINK_ADDR_CH2_V  0xFFFFFFFFU
#define DMA2D_OUTLINK_ADDR_CH2_S  0

/** DMA2D_OUT_STATE_CH2_REG register
 *  Represents the working status of the tx descriptor of channel 2
 */
#define DMA2D_OUT_STATE_CH2_REG (DR_REG_DMA2D_BASE + 0x224)
/** DMA2D_OUTLINK_DSCR_ADDR_CH2 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current outlink descriptor's address.
 */
#define DMA2D_OUTLINK_DSCR_ADDR_CH2    0x0003FFFFU
#define DMA2D_OUTLINK_DSCR_ADDR_CH2_M  (DMA2D_OUTLINK_DSCR_ADDR_CH2_V << DMA2D_OUTLINK_DSCR_ADDR_CH2_S)
#define DMA2D_OUTLINK_DSCR_ADDR_CH2_V  0x0003FFFFU
#define DMA2D_OUTLINK_DSCR_ADDR_CH2_S  0
/** DMA2D_OUT_DSCR_STATE_CH2 : RO; bitpos: [19:18]; default: 0;
 *  This register stores the current descriptor state machine state.
 */
#define DMA2D_OUT_DSCR_STATE_CH2    0x00000003U
#define DMA2D_OUT_DSCR_STATE_CH2_M  (DMA2D_OUT_DSCR_STATE_CH2_V << DMA2D_OUT_DSCR_STATE_CH2_S)
#define DMA2D_OUT_DSCR_STATE_CH2_V  0x00000003U
#define DMA2D_OUT_DSCR_STATE_CH2_S  18
/** DMA2D_OUT_STATE_CH2 : RO; bitpos: [23:20]; default: 0;
 *  This register stores the current control module state machine state.
 */
#define DMA2D_OUT_STATE_CH2    0x0000000FU
#define DMA2D_OUT_STATE_CH2_M  (DMA2D_OUT_STATE_CH2_V << DMA2D_OUT_STATE_CH2_S)
#define DMA2D_OUT_STATE_CH2_V  0x0000000FU
#define DMA2D_OUT_STATE_CH2_S  20
/** DMA2D_OUT_RESET_AVAIL_CH2 : RO; bitpos: [24]; default: 1;
 *  This register indicate that if the channel reset is safety.
 */
#define DMA2D_OUT_RESET_AVAIL_CH2    (BIT(24))
#define DMA2D_OUT_RESET_AVAIL_CH2_M  (DMA2D_OUT_RESET_AVAIL_CH2_V << DMA2D_OUT_RESET_AVAIL_CH2_S)
#define DMA2D_OUT_RESET_AVAIL_CH2_V  0x00000001U
#define DMA2D_OUT_RESET_AVAIL_CH2_S  24

/** DMA2D_OUT_EOF_DES_ADDR_CH2_REG register
 *  Represents the address associated with the outlink descriptor of channel 2
 */
#define DMA2D_OUT_EOF_DES_ADDR_CH2_REG (DR_REG_DMA2D_BASE + 0x228)
/** DMA2D_OUT_EOF_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the outlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define DMA2D_OUT_EOF_DES_ADDR_CH2    0xFFFFFFFFU
#define DMA2D_OUT_EOF_DES_ADDR_CH2_M  (DMA2D_OUT_EOF_DES_ADDR_CH2_V << DMA2D_OUT_EOF_DES_ADDR_CH2_S)
#define DMA2D_OUT_EOF_DES_ADDR_CH2_V  0xFFFFFFFFU
#define DMA2D_OUT_EOF_DES_ADDR_CH2_S  0

/** DMA2D_OUT_DSCR_CH2_REG register
 *  Represents the address associated with the outlink descriptor of channel 2
 */
#define DMA2D_OUT_DSCR_CH2_REG (DR_REG_DMA2D_BASE + 0x22c)
/** DMA2D_OUTLINK_DSCR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the next outlink descriptor address y.
 */
#define DMA2D_OUTLINK_DSCR_CH2    0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_CH2_M  (DMA2D_OUTLINK_DSCR_CH2_V << DMA2D_OUTLINK_DSCR_CH2_S)
#define DMA2D_OUTLINK_DSCR_CH2_V  0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_CH2_S  0

/** DMA2D_OUT_DSCR_BF0_CH2_REG register
 *  Represents the address associated with the outlink descriptor of channel 2
 */
#define DMA2D_OUT_DSCR_BF0_CH2_REG (DR_REG_DMA2D_BASE + 0x230)
/** DMA2D_OUTLINK_DSCR_BF0_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last outlink descriptor's next address y-1.
 */
#define DMA2D_OUTLINK_DSCR_BF0_CH2    0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_BF0_CH2_M  (DMA2D_OUTLINK_DSCR_BF0_CH2_V << DMA2D_OUTLINK_DSCR_BF0_CH2_S)
#define DMA2D_OUTLINK_DSCR_BF0_CH2_V  0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_BF0_CH2_S  0

/** DMA2D_OUT_DSCR_BF1_CH2_REG register
 *  Represents the address associated with the outlink descriptor of channel 2
 */
#define DMA2D_OUT_DSCR_BF1_CH2_REG (DR_REG_DMA2D_BASE + 0x234)
/** DMA2D_OUTLINK_DSCR_BF1_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last outlink descriptor's next address y-2.
 */
#define DMA2D_OUTLINK_DSCR_BF1_CH2    0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_BF1_CH2_M  (DMA2D_OUTLINK_DSCR_BF1_CH2_V << DMA2D_OUTLINK_DSCR_BF1_CH2_S)
#define DMA2D_OUTLINK_DSCR_BF1_CH2_V  0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_BF1_CH2_S  0

/** DMA2D_OUT_PERI_SEL_CH2_REG register
 *  Configures the tx peripheral of channel 2
 */
#define DMA2D_OUT_PERI_SEL_CH2_REG (DR_REG_DMA2D_BASE + 0x238)
/** DMA2D_OUT_PERI_SEL_CH2 : R/W; bitpos: [2:0]; default: 7;
 *  This register is used to select peripheral for Tx channel   0:  jpeg     1:
 *  display-1     2: display-2     3: display-3      7: no choose
 */
#define DMA2D_OUT_PERI_SEL_CH2    0x00000007U
#define DMA2D_OUT_PERI_SEL_CH2_M  (DMA2D_OUT_PERI_SEL_CH2_V << DMA2D_OUT_PERI_SEL_CH2_S)
#define DMA2D_OUT_PERI_SEL_CH2_V  0x00000007U
#define DMA2D_OUT_PERI_SEL_CH2_S  0

/** DMA2D_OUT_ARB_CH2_REG register
 *  Configures the tx arbiter of channel 2
 */
#define DMA2D_OUT_ARB_CH2_REG (DR_REG_DMA2D_BASE + 0x23c)
/** DMA2D_OUT_ARB_TOKEN_NUM_CH2 : R/W; bitpos: [3:0]; default: 0;
 *  Set the max number of token count of arbiter
 */
#define DMA2D_OUT_ARB_TOKEN_NUM_CH2    0x0000000FU
#define DMA2D_OUT_ARB_TOKEN_NUM_CH2_M  (DMA2D_OUT_ARB_TOKEN_NUM_CH2_V << DMA2D_OUT_ARB_TOKEN_NUM_CH2_S)
#define DMA2D_OUT_ARB_TOKEN_NUM_CH2_V  0x0000000FU
#define DMA2D_OUT_ARB_TOKEN_NUM_CH2_S  0
/** DMA2D_OUT_ARB_PRIORITY_CH2 : R/W; bitpos: [7:4]; default: 0;
 *  Set the priority of channel
 */
#define DMA2D_OUT_ARB_PRIORITY_CH2    0x0000000FU
#define DMA2D_OUT_ARB_PRIORITY_CH2_M  (DMA2D_OUT_ARB_PRIORITY_CH2_V << DMA2D_OUT_ARB_PRIORITY_CH2_S)
#define DMA2D_OUT_ARB_PRIORITY_CH2_V  0x0000000FU
#define DMA2D_OUT_ARB_PRIORITY_CH2_S  4

/** DMA2D_OUT_RO_STATUS_CH2_REG register
 *  Represents the status of the tx reorder module of channel 2
 */
#define DMA2D_OUT_RO_STATUS_CH2_REG (DR_REG_DMA2D_BASE + 0x240)
/** DMA2D_OUTFIFO_RO_CNT_CH2 : RO; bitpos: [5:0]; default: 0;
 *  The register stores the byte number of the data in color convert Tx FIFO for
 *  channel 0.
 */
#define DMA2D_OUTFIFO_RO_CNT_CH2    0x0000003FU
#define DMA2D_OUTFIFO_RO_CNT_CH2_M  (DMA2D_OUTFIFO_RO_CNT_CH2_V << DMA2D_OUTFIFO_RO_CNT_CH2_S)
#define DMA2D_OUTFIFO_RO_CNT_CH2_V  0x0000003FU
#define DMA2D_OUTFIFO_RO_CNT_CH2_S  0
/** DMA2D_OUT_RO_WR_STATE_CH2 : RO; bitpos: [7:6]; default: 0;
 *  The register stores the state of read ram of reorder
 */
#define DMA2D_OUT_RO_WR_STATE_CH2    0x00000003U
#define DMA2D_OUT_RO_WR_STATE_CH2_M  (DMA2D_OUT_RO_WR_STATE_CH2_V << DMA2D_OUT_RO_WR_STATE_CH2_S)
#define DMA2D_OUT_RO_WR_STATE_CH2_V  0x00000003U
#define DMA2D_OUT_RO_WR_STATE_CH2_S  6
/** DMA2D_OUT_RO_RD_STATE_CH2 : RO; bitpos: [9:8]; default: 0;
 *  The register stores the state of write ram of reorder
 */
#define DMA2D_OUT_RO_RD_STATE_CH2    0x00000003U
#define DMA2D_OUT_RO_RD_STATE_CH2_M  (DMA2D_OUT_RO_RD_STATE_CH2_V << DMA2D_OUT_RO_RD_STATE_CH2_S)
#define DMA2D_OUT_RO_RD_STATE_CH2_V  0x00000003U
#define DMA2D_OUT_RO_RD_STATE_CH2_S  8
/** DMA2D_OUT_PIXEL_BYTE_CH2 : RO; bitpos: [13:10]; default: 0;
 *  the number of bytes contained in a pixel at TX channel     0: 1byte     1: 1.5bytes
 *  2 : 2bytes     3: 2.5bytes     4: 3bytes     5: 4bytes
 */
#define DMA2D_OUT_PIXEL_BYTE_CH2    0x0000000FU
#define DMA2D_OUT_PIXEL_BYTE_CH2_M  (DMA2D_OUT_PIXEL_BYTE_CH2_V << DMA2D_OUT_PIXEL_BYTE_CH2_S)
#define DMA2D_OUT_PIXEL_BYTE_CH2_V  0x0000000FU
#define DMA2D_OUT_PIXEL_BYTE_CH2_S  10
/** DMA2D_OUT_BURST_BLOCK_NUM_CH2 : RO; bitpos: [17:14]; default: 0;
 *  the number of macro blocks contained in a burst of data at TX channel
 */
#define DMA2D_OUT_BURST_BLOCK_NUM_CH2    0x0000000FU
#define DMA2D_OUT_BURST_BLOCK_NUM_CH2_M  (DMA2D_OUT_BURST_BLOCK_NUM_CH2_V << DMA2D_OUT_BURST_BLOCK_NUM_CH2_S)
#define DMA2D_OUT_BURST_BLOCK_NUM_CH2_V  0x0000000FU
#define DMA2D_OUT_BURST_BLOCK_NUM_CH2_S  14

/** DMA2D_OUT_COLOR_CONVERT_CH2_REG register
 *  Configures the tx color convert of channel 2
 */
#define DMA2D_OUT_COLOR_CONVERT_CH2_REG (DR_REG_DMA2D_BASE + 0x248)
/** DMA2D_OUT_COLOR_OUTPUT_SEL_CH2 : R/W; bitpos: [1:0]; default: 0;
 *  Set final color convert process and output type    0: RGB888 to RGB565     1:
 *  YUV444 to YUV422     2: output directly
 */
#define DMA2D_OUT_COLOR_OUTPUT_SEL_CH2    0x00000003U
#define DMA2D_OUT_COLOR_OUTPUT_SEL_CH2_M  (DMA2D_OUT_COLOR_OUTPUT_SEL_CH2_V << DMA2D_OUT_COLOR_OUTPUT_SEL_CH2_S)
#define DMA2D_OUT_COLOR_OUTPUT_SEL_CH2_V  0x00000003U
#define DMA2D_OUT_COLOR_OUTPUT_SEL_CH2_S  0
/** DMA2D_OUT_COLOR_3B_PROC_EN_CH2 : R/W; bitpos: [2]; default: 0;
 *  Enable generic color convert module between color input & color output, need to
 *  configure parameter.
 */
#define DMA2D_OUT_COLOR_3B_PROC_EN_CH2    (BIT(2))
#define DMA2D_OUT_COLOR_3B_PROC_EN_CH2_M  (DMA2D_OUT_COLOR_3B_PROC_EN_CH2_V << DMA2D_OUT_COLOR_3B_PROC_EN_CH2_S)
#define DMA2D_OUT_COLOR_3B_PROC_EN_CH2_V  0x00000001U
#define DMA2D_OUT_COLOR_3B_PROC_EN_CH2_S  2
/** DMA2D_OUT_COLOR_INPUT_SEL_CH2 : R/W; bitpos: [5:3]; default: 7;
 *  Set first color convert process and input color type    0: RGB565 to RGB888     1:
 *  YUV422 to YUV444      2: Other 2byte/pixel type    3: Other 3byte/pixel type    7:
 *  disable color space convert
 */
#define DMA2D_OUT_COLOR_INPUT_SEL_CH2    0x00000007U
#define DMA2D_OUT_COLOR_INPUT_SEL_CH2_M  (DMA2D_OUT_COLOR_INPUT_SEL_CH2_V << DMA2D_OUT_COLOR_INPUT_SEL_CH2_S)
#define DMA2D_OUT_COLOR_INPUT_SEL_CH2_V  0x00000007U
#define DMA2D_OUT_COLOR_INPUT_SEL_CH2_S  3

