espressif/esp-idf/components/soc/esp32s31/register/soc/dma2d_reg.h
/** DMA2D_OUT_COLOR_PARAM3_CH3_REG register
 *  Configures the tx color convert parameter of channel 3
 */
#define DMA2D_OUT_COLOR_PARAM3_CH3_REG (DR_REG_DMA2D_BASE + 0x35c)
/** DMA2D_OUT_COLOR_PARAM_M1_CH3 : R/W; bitpos: [27:0]; default: 35540784;
 *  Set last 2 parameter of midium significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_M1_CH3    0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_M1_CH3_M  (DMA2D_OUT_COLOR_PARAM_M1_CH3_V << DMA2D_OUT_COLOR_PARAM_M1_CH3_S)
#define DMA2D_OUT_COLOR_PARAM_M1_CH3_V  0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_M1_CH3_S  0

/** DMA2D_OUT_COLOR_PARAM4_CH3_REG register
 *  Configures the tx color convert parameter of channel 3
 */
#define DMA2D_OUT_COLOR_PARAM4_CH3_REG (DR_REG_DMA2D_BASE + 0x360)
/** DMA2D_OUT_COLOR_PARAM_L0_CH3 : R/W; bitpos: [20:0]; default: 528682;
 *  Set first 2 parameter of least significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_L0_CH3    0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_L0_CH3_M  (DMA2D_OUT_COLOR_PARAM_L0_CH3_V << DMA2D_OUT_COLOR_PARAM_L0_CH3_S)
#define DMA2D_OUT_COLOR_PARAM_L0_CH3_V  0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_L0_CH3_S  0

/** DMA2D_OUT_COLOR_PARAM5_CH3_REG register
 *  Configures the tx color convert parameter of channel 3
 */
#define DMA2D_OUT_COLOR_PARAM5_CH3_REG (DR_REG_DMA2D_BASE + 0x364)
/** DMA2D_OUT_COLOR_PARAM_L1_CH3 : R/W; bitpos: [27:0]; default: 195899392;
 *  Set last 2 parameter of least significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_L1_CH3    0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_L1_CH3_M  (DMA2D_OUT_COLOR_PARAM_L1_CH3_V << DMA2D_OUT_COLOR_PARAM_L1_CH3_S)
#define DMA2D_OUT_COLOR_PARAM_L1_CH3_V  0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_L1_CH3_S  0

/** DMA2D_OUT_ETM_CONF_CH3_REG register
 *  Configures the tx etm of channel 3
 */
#define DMA2D_OUT_ETM_CONF_CH3_REG (DR_REG_DMA2D_BASE + 0x368)
/** DMA2D_OUT_ETM_EN_CH3 : R/W; bitpos: [0]; default: 0;
 *  Configures the enable of the etm function, 1 is enable.
 */
#define DMA2D_OUT_ETM_EN_CH3    (BIT(0))
#define DMA2D_OUT_ETM_EN_CH3_M  (DMA2D_OUT_ETM_EN_CH3_V << DMA2D_OUT_ETM_EN_CH3_S)
#define DMA2D_OUT_ETM_EN_CH3_V  0x00000001U
#define DMA2D_OUT_ETM_EN_CH3_S  0
/** DMA2D_OUT_ETM_LOOP_EN_CH3 : R/W; bitpos: [1]; default: 0;
 *  Configures the enable of the descriptors loop etm function, 1 is enable.
 */
#define DMA2D_OUT_ETM_LOOP_EN_CH3    (BIT(1))
#define DMA2D_OUT_ETM_LOOP_EN_CH3_M  (DMA2D_OUT_ETM_LOOP_EN_CH3_V << DMA2D_OUT_ETM_LOOP_EN_CH3_S)
#define DMA2D_OUT_ETM_LOOP_EN_CH3_V  0x00000001U
#define DMA2D_OUT_ETM_LOOP_EN_CH3_S  1
/** DMA2D_OUT_DSCR_TASK_MAK_CH3 : R/W; bitpos: [3:2]; default: 1;
 *  Configures the maximum number of cacheable descriptors.
 */
#define DMA2D_OUT_DSCR_TASK_MAK_CH3    0x00000003U
#define DMA2D_OUT_DSCR_TASK_MAK_CH3_M  (DMA2D_OUT_DSCR_TASK_MAK_CH3_V << DMA2D_OUT_DSCR_TASK_MAK_CH3_S)
#define DMA2D_OUT_DSCR_TASK_MAK_CH3_V  0x00000003U
#define DMA2D_OUT_DSCR_TASK_MAK_CH3_S  2

/** DMA2D_OUT_DSCR_PORT_BLK_CH3_REG register
 *  Configures the tx block size in dscr port mode
 */
#define DMA2D_OUT_DSCR_PORT_BLK_CH3_REG (DR_REG_DMA2D_BASE + 0x36c)
/** DMA2D_OUT_DSCR_PORT_BLK_H_CH3 : R/W; bitpos: [13:0]; default: 18;
 *  Set the vertical height of tx block size in dscr port mode
 */
#define DMA2D_OUT_DSCR_PORT_BLK_H_CH3    0x00003FFFU
#define DMA2D_OUT_DSCR_PORT_BLK_H_CH3_M  (DMA2D_OUT_DSCR_PORT_BLK_H_CH3_V << DMA2D_OUT_DSCR_PORT_BLK_H_CH3_S)
#define DMA2D_OUT_DSCR_PORT_BLK_H_CH3_V  0x00003FFFU
#define DMA2D_OUT_DSCR_PORT_BLK_H_CH3_S  0
/** DMA2D_OUT_DSCR_PORT_BLK_V_CH3 : R/W; bitpos: [27:14]; default: 18;
 *  Set the horizontal width of tx block size in dscr port mode
 */
#define DMA2D_OUT_DSCR_PORT_BLK_V_CH3    0x00003FFFU
#define DMA2D_OUT_DSCR_PORT_BLK_V_CH3_M  (DMA2D_OUT_DSCR_PORT_BLK_V_CH3_V << DMA2D_OUT_DSCR_PORT_BLK_V_CH3_S)
#define DMA2D_OUT_DSCR_PORT_BLK_V_CH3_V  0x00003FFFU
#define DMA2D_OUT_DSCR_PORT_BLK_V_CH3_S  14

/** DMA2D_IN_CONF0_CH0_REG register
 *  Configures the rx direction of channel 0
 */
#define DMA2D_IN_CONF0_CH0_REG (DR_REG_DMA2D_BASE + 0x500)
/** DMA2D_IN_MEM_TRANS_EN_CH0 : R/W; bitpos: [0]; default: 0;
 *  enable memory trans of the same channel
 */
#define DMA2D_IN_MEM_TRANS_EN_CH0    (BIT(0))
#define DMA2D_IN_MEM_TRANS_EN_CH0_M  (DMA2D_IN_MEM_TRANS_EN_CH0_V << DMA2D_IN_MEM_TRANS_EN_CH0_S)
#define DMA2D_IN_MEM_TRANS_EN_CH0_V  0x00000001U
#define DMA2D_IN_MEM_TRANS_EN_CH0_S  0
/** DMA2D_INDSCR_BURST_EN_CH0 : R/W; bitpos: [2]; default: 0;
 *  Set this bit to 1 to enable INCR burst transfer for Rx transmitting link descriptor
 *  when accessing SRAM.
 */
#define DMA2D_INDSCR_BURST_EN_CH0    (BIT(2))
#define DMA2D_INDSCR_BURST_EN_CH0_M  (DMA2D_INDSCR_BURST_EN_CH0_V << DMA2D_INDSCR_BURST_EN_CH0_S)
#define DMA2D_INDSCR_BURST_EN_CH0_V  0x00000001U
#define DMA2D_INDSCR_BURST_EN_CH0_S  2
/** DMA2D_IN_ECC_AES_EN_CH0 : R/W; bitpos: [3]; default: 0;
 *  When access address space is ecc/aes area, this bit should be set to 1. In this
 *  case, the start address of square should be 16-bit aligned. The width of square
 *  multiply byte number of one pixel should be 16-bit aligned.
 */
#define DMA2D_IN_ECC_AES_EN_CH0    (BIT(3))
#define DMA2D_IN_ECC_AES_EN_CH0_M  (DMA2D_IN_ECC_AES_EN_CH0_V << DMA2D_IN_ECC_AES_EN_CH0_S)
#define DMA2D_IN_ECC_AES_EN_CH0_V  0x00000001U
#define DMA2D_IN_ECC_AES_EN_CH0_S  3
/** DMA2D_IN_CHECK_OWNER_CH0 : R/W; bitpos: [4]; default: 0;
 *  Set this bit to enable checking the owner attribute of the link descriptor.
 */
#define DMA2D_IN_CHECK_OWNER_CH0    (BIT(4))
#define DMA2D_IN_CHECK_OWNER_CH0_M  (DMA2D_IN_CHECK_OWNER_CH0_V << DMA2D_IN_CHECK_OWNER_CH0_S)
#define DMA2D_IN_CHECK_OWNER_CH0_V  0x00000001U
#define DMA2D_IN_CHECK_OWNER_CH0_S  4
/** DMA2D_IN_LOOP_TEST_CH0 : R/W; bitpos: [5]; default: 0;
 *  reserved
 */
#define DMA2D_IN_LOOP_TEST_CH0    (BIT(5))
#define DMA2D_IN_LOOP_TEST_CH0_M  (DMA2D_IN_LOOP_TEST_CH0_V << DMA2D_IN_LOOP_TEST_CH0_S)
#define DMA2D_IN_LOOP_TEST_CH0_V  0x00000001U
#define DMA2D_IN_LOOP_TEST_CH0_S  5
/** DMA2D_IN_MEM_BURST_LENGTH_CH0 : R/W; bitpos: [8:6]; default: 0;
 *  Block size of Rx channel 0. 0: single      1: 16 bytes      2: 32 bytes    3: 64
 *  bytes    4: 128 bytes
 */
#define DMA2D_IN_MEM_BURST_LENGTH_CH0    0x00000007U
#define DMA2D_IN_MEM_BURST_LENGTH_CH0_M  (DMA2D_IN_MEM_BURST_LENGTH_CH0_V << DMA2D_IN_MEM_BURST_LENGTH_CH0_S)
#define DMA2D_IN_MEM_BURST_LENGTH_CH0_V  0x00000007U
#define DMA2D_IN_MEM_BURST_LENGTH_CH0_S  6
/** DMA2D_IN_MACRO_BLOCK_SIZE_CH0 : R/W; bitpos: [10:9]; default: 0;
 *  Sel RX macro-block size 0: 8pixel*8pixel     1: 8pixel*16pixel     2:
 *  16pixel*16pixel     3: no macro-block     , only useful in mode 1 of the link
 *  descriptor
 */
#define DMA2D_IN_MACRO_BLOCK_SIZE_CH0    0x00000003U
#define DMA2D_IN_MACRO_BLOCK_SIZE_CH0_M  (DMA2D_IN_MACRO_BLOCK_SIZE_CH0_V << DMA2D_IN_MACRO_BLOCK_SIZE_CH0_S)
#define DMA2D_IN_MACRO_BLOCK_SIZE_CH0_V  0x00000003U
#define DMA2D_IN_MACRO_BLOCK_SIZE_CH0_S  9
/** DMA2D_IN_DSCR_PORT_EN_CH0 : R/W; bitpos: [11]; default: 0;
 *  Set this bit to 1 to obtain descriptor from IP port
 */
#define DMA2D_IN_DSCR_PORT_EN_CH0    (BIT(11))
#define DMA2D_IN_DSCR_PORT_EN_CH0_M  (DMA2D_IN_DSCR_PORT_EN_CH0_V << DMA2D_IN_DSCR_PORT_EN_CH0_S)
#define DMA2D_IN_DSCR_PORT_EN_CH0_V  0x00000001U
#define DMA2D_IN_DSCR_PORT_EN_CH0_S  11
/** DMA2D_IN_PAGE_BOUND_EN_CH0 : R/W; bitpos: [12]; default: 0;
 *  Set this bit to 1 to make sure AXI write data don't cross the address boundary
 *  which define by mem_burst_length
 */
#define DMA2D_IN_PAGE_BOUND_EN_CH0    (BIT(12))
#define DMA2D_IN_PAGE_BOUND_EN_CH0_M  (DMA2D_IN_PAGE_BOUND_EN_CH0_V << DMA2D_IN_PAGE_BOUND_EN_CH0_S)
#define DMA2D_IN_PAGE_BOUND_EN_CH0_V  0x00000001U
#define DMA2D_IN_PAGE_BOUND_EN_CH0_S  12
/** DMA2D_IN_REORDER_EN_CH0 : R/W; bitpos: [16]; default: 0;
 *  Enable RX channel 0 macro block reorder when set to 1, only channel0 have this
 *  selection
 */
#define DMA2D_IN_REORDER_EN_CH0    (BIT(16))
#define DMA2D_IN_REORDER_EN_CH0_M  (DMA2D_IN_REORDER_EN_CH0_V << DMA2D_IN_REORDER_EN_CH0_S)
#define DMA2D_IN_REORDER_EN_CH0_V  0x00000001U
#define DMA2D_IN_REORDER_EN_CH0_S  16
/** DMA2D_IN_RST_CH0 : R/W; bitpos: [24]; default: 0;
 *  Write 1 then write 0 to this bit to reset Rx channel
 */
#define DMA2D_IN_RST_CH0    (BIT(24))
#define DMA2D_IN_RST_CH0_M  (DMA2D_IN_RST_CH0_V << DMA2D_IN_RST_CH0_S)
#define DMA2D_IN_RST_CH0_V  0x00000001U
#define DMA2D_IN_RST_CH0_S  24
/** DMA2D_IN_CMD_DISABLE_CH0 : R/W; bitpos: [25]; default: 0;
 *  Write 1 before reset and write 0 after reset
 */
#define DMA2D_IN_CMD_DISABLE_CH0    (BIT(25))
#define DMA2D_IN_CMD_DISABLE_CH0_M  (DMA2D_IN_CMD_DISABLE_CH0_V << DMA2D_IN_CMD_DISABLE_CH0_S)
#define DMA2D_IN_CMD_DISABLE_CH0_V  0x00000001U
#define DMA2D_IN_CMD_DISABLE_CH0_S  25
/** DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH0 : R/W; bitpos: [26]; default: 0;
 *  Set this bit to 1 to disable arbiter optimum weight function.
 */
#define DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH0    (BIT(26))
#define DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH0_M  (DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH0_V << DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH0_S)
#define DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH0_V  0x00000001U
#define DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH0_S  26

