espressif/esp-idf/components/soc/esp32s31/register/soc/dma2d_reg.h
/** DMA2D_INFIFO_STATUS_CH1_REG register
 *  Represents the status of the rx fifo of channel 1
 */
#define DMA2D_INFIFO_STATUS_CH1_REG (DR_REG_DMA2D_BASE + 0x614)
/** DMA2D_INFIFO_FULL_L2_CH1 : RO; bitpos: [0]; default: 0;
 *  Rx FIFO full signal for Rx channel.
 */
#define DMA2D_INFIFO_FULL_L2_CH1    (BIT(0))
#define DMA2D_INFIFO_FULL_L2_CH1_M  (DMA2D_INFIFO_FULL_L2_CH1_V << DMA2D_INFIFO_FULL_L2_CH1_S)
#define DMA2D_INFIFO_FULL_L2_CH1_V  0x00000001U
#define DMA2D_INFIFO_FULL_L2_CH1_S  0
/** DMA2D_INFIFO_EMPTY_L2_CH1 : RO; bitpos: [1]; default: 1;
 *  Rx FIFO empty signal for Rx channel.
 */
#define DMA2D_INFIFO_EMPTY_L2_CH1    (BIT(1))
#define DMA2D_INFIFO_EMPTY_L2_CH1_M  (DMA2D_INFIFO_EMPTY_L2_CH1_V << DMA2D_INFIFO_EMPTY_L2_CH1_S)
#define DMA2D_INFIFO_EMPTY_L2_CH1_V  0x00000001U
#define DMA2D_INFIFO_EMPTY_L2_CH1_S  1
/** DMA2D_INFIFO_CNT_L2_CH1 : RO; bitpos: [5:2]; default: 0;
 *  The register stores the byte number of the data in Rx FIFO for Rx channel.
 */
#define DMA2D_INFIFO_CNT_L2_CH1    0x0000000FU
#define DMA2D_INFIFO_CNT_L2_CH1_M  (DMA2D_INFIFO_CNT_L2_CH1_V << DMA2D_INFIFO_CNT_L2_CH1_S)
#define DMA2D_INFIFO_CNT_L2_CH1_V  0x0000000FU
#define DMA2D_INFIFO_CNT_L2_CH1_S  2
/** DMA2D_IN_REMAIN_UNDER_1B_CH1 : RO; bitpos: [7]; default: 0;
 *  reserved
 */
#define DMA2D_IN_REMAIN_UNDER_1B_CH1    (BIT(7))
#define DMA2D_IN_REMAIN_UNDER_1B_CH1_M  (DMA2D_IN_REMAIN_UNDER_1B_CH1_V << DMA2D_IN_REMAIN_UNDER_1B_CH1_S)
#define DMA2D_IN_REMAIN_UNDER_1B_CH1_V  0x00000001U
#define DMA2D_IN_REMAIN_UNDER_1B_CH1_S  7
/** DMA2D_IN_REMAIN_UNDER_2B_CH1 : RO; bitpos: [8]; default: 0;
 *  reserved
 */
#define DMA2D_IN_REMAIN_UNDER_2B_CH1    (BIT(8))
#define DMA2D_IN_REMAIN_UNDER_2B_CH1_M  (DMA2D_IN_REMAIN_UNDER_2B_CH1_V << DMA2D_IN_REMAIN_UNDER_2B_CH1_S)
#define DMA2D_IN_REMAIN_UNDER_2B_CH1_V  0x00000001U
#define DMA2D_IN_REMAIN_UNDER_2B_CH1_S  8
/** DMA2D_IN_REMAIN_UNDER_3B_CH1 : RO; bitpos: [9]; default: 0;
 *  reserved
 */
#define DMA2D_IN_REMAIN_UNDER_3B_CH1    (BIT(9))
#define DMA2D_IN_REMAIN_UNDER_3B_CH1_M  (DMA2D_IN_REMAIN_UNDER_3B_CH1_V << DMA2D_IN_REMAIN_UNDER_3B_CH1_S)
#define DMA2D_IN_REMAIN_UNDER_3B_CH1_V  0x00000001U
#define DMA2D_IN_REMAIN_UNDER_3B_CH1_S  9
/** DMA2D_IN_REMAIN_UNDER_4B_CH1 : RO; bitpos: [10]; default: 0;
 *  reserved
 */
#define DMA2D_IN_REMAIN_UNDER_4B_CH1    (BIT(10))
#define DMA2D_IN_REMAIN_UNDER_4B_CH1_M  (DMA2D_IN_REMAIN_UNDER_4B_CH1_V << DMA2D_IN_REMAIN_UNDER_4B_CH1_S)
#define DMA2D_IN_REMAIN_UNDER_4B_CH1_V  0x00000001U
#define DMA2D_IN_REMAIN_UNDER_4B_CH1_S  10
/** DMA2D_IN_REMAIN_UNDER_5B_CH1 : RO; bitpos: [11]; default: 0;
 *  reserved
 */
#define DMA2D_IN_REMAIN_UNDER_5B_CH1    (BIT(11))
#define DMA2D_IN_REMAIN_UNDER_5B_CH1_M  (DMA2D_IN_REMAIN_UNDER_5B_CH1_V << DMA2D_IN_REMAIN_UNDER_5B_CH1_S)
#define DMA2D_IN_REMAIN_UNDER_5B_CH1_V  0x00000001U
#define DMA2D_IN_REMAIN_UNDER_5B_CH1_S  11
/** DMA2D_IN_REMAIN_UNDER_6B_CH1 : RO; bitpos: [12]; default: 0;
 *  reserved
 */
#define DMA2D_IN_REMAIN_UNDER_6B_CH1    (BIT(12))
#define DMA2D_IN_REMAIN_UNDER_6B_CH1_M  (DMA2D_IN_REMAIN_UNDER_6B_CH1_V << DMA2D_IN_REMAIN_UNDER_6B_CH1_S)
#define DMA2D_IN_REMAIN_UNDER_6B_CH1_V  0x00000001U
#define DMA2D_IN_REMAIN_UNDER_6B_CH1_S  12
/** DMA2D_IN_REMAIN_UNDER_7B_CH1 : RO; bitpos: [13]; default: 0;
 *  reserved
 */
#define DMA2D_IN_REMAIN_UNDER_7B_CH1    (BIT(13))
#define DMA2D_IN_REMAIN_UNDER_7B_CH1_M  (DMA2D_IN_REMAIN_UNDER_7B_CH1_V << DMA2D_IN_REMAIN_UNDER_7B_CH1_S)
#define DMA2D_IN_REMAIN_UNDER_7B_CH1_V  0x00000001U
#define DMA2D_IN_REMAIN_UNDER_7B_CH1_S  13
/** DMA2D_IN_REMAIN_UNDER_8B_CH1 : RO; bitpos: [14]; default: 0;
 *  reserved
 */
#define DMA2D_IN_REMAIN_UNDER_8B_CH1    (BIT(14))
#define DMA2D_IN_REMAIN_UNDER_8B_CH1_M  (DMA2D_IN_REMAIN_UNDER_8B_CH1_V << DMA2D_IN_REMAIN_UNDER_8B_CH1_S)
#define DMA2D_IN_REMAIN_UNDER_8B_CH1_V  0x00000001U
#define DMA2D_IN_REMAIN_UNDER_8B_CH1_S  14
/** DMA2D_INFIFO_FULL_L1_CH1 : RO; bitpos: [15]; default: 0;
 *  Rx FIFO full signal for Rx channel 0.
 */
#define DMA2D_INFIFO_FULL_L1_CH1    (BIT(15))
#define DMA2D_INFIFO_FULL_L1_CH1_M  (DMA2D_INFIFO_FULL_L1_CH1_V << DMA2D_INFIFO_FULL_L1_CH1_S)
#define DMA2D_INFIFO_FULL_L1_CH1_V  0x00000001U
#define DMA2D_INFIFO_FULL_L1_CH1_S  15
/** DMA2D_INFIFO_EMPTY_L1_CH1 : RO; bitpos: [16]; default: 1;
 *  Rx FIFO empty signal for Rx channel 0.
 */
#define DMA2D_INFIFO_EMPTY_L1_CH1    (BIT(16))
#define DMA2D_INFIFO_EMPTY_L1_CH1_M  (DMA2D_INFIFO_EMPTY_L1_CH1_V << DMA2D_INFIFO_EMPTY_L1_CH1_S)
#define DMA2D_INFIFO_EMPTY_L1_CH1_V  0x00000001U
#define DMA2D_INFIFO_EMPTY_L1_CH1_S  16
/** DMA2D_INFIFO_CNT_L1_CH1 : RO; bitpos: [21:17]; default: 0;
 *  The register stores the byte number of the data in Rx FIFO for Rx channel 0.
 */
#define DMA2D_INFIFO_CNT_L1_CH1    0x0000001FU
#define DMA2D_INFIFO_CNT_L1_CH1_M  (DMA2D_INFIFO_CNT_L1_CH1_V << DMA2D_INFIFO_CNT_L1_CH1_S)
#define DMA2D_INFIFO_CNT_L1_CH1_V  0x0000001FU
#define DMA2D_INFIFO_CNT_L1_CH1_S  17
/** DMA2D_INFIFO_FULL_L3_CH1 : RO; bitpos: [22]; default: 0;
 *  Rx FIFO full signal for Rx channel 0.
 */
#define DMA2D_INFIFO_FULL_L3_CH1    (BIT(22))
#define DMA2D_INFIFO_FULL_L3_CH1_M  (DMA2D_INFIFO_FULL_L3_CH1_V << DMA2D_INFIFO_FULL_L3_CH1_S)
#define DMA2D_INFIFO_FULL_L3_CH1_V  0x00000001U
#define DMA2D_INFIFO_FULL_L3_CH1_S  22
/** DMA2D_INFIFO_EMPTY_L3_CH1 : RO; bitpos: [23]; default: 1;
 *  Rx FIFO empty signal for Rx channel 0.
 */
#define DMA2D_INFIFO_EMPTY_L3_CH1    (BIT(23))
#define DMA2D_INFIFO_EMPTY_L3_CH1_M  (DMA2D_INFIFO_EMPTY_L3_CH1_V << DMA2D_INFIFO_EMPTY_L3_CH1_S)
#define DMA2D_INFIFO_EMPTY_L3_CH1_V  0x00000001U
#define DMA2D_INFIFO_EMPTY_L3_CH1_S  23
/** DMA2D_INFIFO_CNT_L3_CH1 : RO; bitpos: [28:24]; default: 0;
 *  The register stores the byte number of the data in Rx FIFO for Rx channel 0.
 */
#define DMA2D_INFIFO_CNT_L3_CH1    0x0000001FU
#define DMA2D_INFIFO_CNT_L3_CH1_M  (DMA2D_INFIFO_CNT_L3_CH1_V << DMA2D_INFIFO_CNT_L3_CH1_S)
#define DMA2D_INFIFO_CNT_L3_CH1_V  0x0000001FU
#define DMA2D_INFIFO_CNT_L3_CH1_S  24

/** DMA2D_IN_POP_CH1_REG register
 *  Configures the rx fifo of channel 1
 */
#define DMA2D_IN_POP_CH1_REG (DR_REG_DMA2D_BASE + 0x618)
/** DMA2D_INFIFO_RDATA_CH1 : RO; bitpos: [10:0]; default: 1024;
 *  This register stores the data popping from DMA Rx FIFO.
 */
#define DMA2D_INFIFO_RDATA_CH1    0x000007FFU
#define DMA2D_INFIFO_RDATA_CH1_M  (DMA2D_INFIFO_RDATA_CH1_V << DMA2D_INFIFO_RDATA_CH1_S)
#define DMA2D_INFIFO_RDATA_CH1_V  0x000007FFU
#define DMA2D_INFIFO_RDATA_CH1_S  0
/** DMA2D_INFIFO_POP_CH1 : R/W/SC; bitpos: [11]; default: 0;
 *  Set this bit to pop data from DMA Rx FIFO.
 */
#define DMA2D_INFIFO_POP_CH1    (BIT(11))
#define DMA2D_INFIFO_POP_CH1_M  (DMA2D_INFIFO_POP_CH1_V << DMA2D_INFIFO_POP_CH1_S)
#define DMA2D_INFIFO_POP_CH1_V  0x00000001U
#define DMA2D_INFIFO_POP_CH1_S  11

/** DMA2D_IN_LINK_CONF_CH1_REG register
 *  Configures the rx descriptor operations of channel 1
 */
#define DMA2D_IN_LINK_CONF_CH1_REG (DR_REG_DMA2D_BASE + 0x61c)
/** DMA2D_INLINK_AUTO_RET_CH1 : R/W; bitpos: [20]; default: 1;
 *  Set this bit to return to current inlink descriptor's address, when there are some
 *  errors in current receiving data.
 */
#define DMA2D_INLINK_AUTO_RET_CH1    (BIT(20))
#define DMA2D_INLINK_AUTO_RET_CH1_M  (DMA2D_INLINK_AUTO_RET_CH1_V << DMA2D_INLINK_AUTO_RET_CH1_S)
#define DMA2D_INLINK_AUTO_RET_CH1_V  0x00000001U
#define DMA2D_INLINK_AUTO_RET_CH1_S  20
/** DMA2D_INLINK_STOP_CH1 : R/W/SC; bitpos: [21]; default: 0;
 *  Set this bit to stop dealing with the inlink descriptors.
 */
#define DMA2D_INLINK_STOP_CH1    (BIT(21))
#define DMA2D_INLINK_STOP_CH1_M  (DMA2D_INLINK_STOP_CH1_V << DMA2D_INLINK_STOP_CH1_S)
#define DMA2D_INLINK_STOP_CH1_V  0x00000001U
#define DMA2D_INLINK_STOP_CH1_S  21
/** DMA2D_INLINK_START_CH1 : R/W/SC; bitpos: [22]; default: 0;
 *  Set this bit to start dealing with the inlink descriptors.
 */
#define DMA2D_INLINK_START_CH1    (BIT(22))
#define DMA2D_INLINK_START_CH1_M  (DMA2D_INLINK_START_CH1_V << DMA2D_INLINK_START_CH1_S)
#define DMA2D_INLINK_START_CH1_V  0x00000001U
#define DMA2D_INLINK_START_CH1_S  22
/** DMA2D_INLINK_RESTART_CH1 : R/W/SC; bitpos: [23]; default: 0;
 *  Set this bit to mount a new inlink descriptor.
 */
#define DMA2D_INLINK_RESTART_CH1    (BIT(23))
#define DMA2D_INLINK_RESTART_CH1_M  (DMA2D_INLINK_RESTART_CH1_V << DMA2D_INLINK_RESTART_CH1_S)
#define DMA2D_INLINK_RESTART_CH1_V  0x00000001U
#define DMA2D_INLINK_RESTART_CH1_S  23
/** DMA2D_INLINK_PARK_CH1 : RO; bitpos: [24]; default: 1;
 *  1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is
 *  working.
 */
#define DMA2D_INLINK_PARK_CH1    (BIT(24))
#define DMA2D_INLINK_PARK_CH1_M  (DMA2D_INLINK_PARK_CH1_V << DMA2D_INLINK_PARK_CH1_S)
#define DMA2D_INLINK_PARK_CH1_V  0x00000001U
#define DMA2D_INLINK_PARK_CH1_S  24

